[
    {
        "id": 116,
        "user": 1,
        "anime": {
            "id": 30309,
            "name": "Steins;Gate",
            "desc": "Eccentric scientist Rintarou Okabe has a never-ending thirst for scientific exploration. Together with his ditzy but well-meaning friend Mayuri Shiina and his roommate Itaru Hashida, Okabe founds the Future Gadget Laboratory in the hopes of creating technological innovations that baffle the human psyche. Despite claims of grandeur, the only notable \"gadget\" the trio have created is a microwave that has the mystifying power to turn bananas into green goo.\r\n\r\nHowever, when Okabe attends a conference on time travel, he experiences a series of strange events that lead him to believe that there is more to the \"Phone Microwave\" gadget than meets the eye. Apparently able to send text messages into the past using the microwave, Okabe dabbles further with the \"time machine,\" attracting the ire and attention of the mysterious organization SERN.\r\n\r\nDue to the novel discovery, Okabe and his friends find themselves in an ever-present danger. As he works to mitigate the damage his invention has caused to the timeline, Okabe fights a battle to not only save his loved ones but also to preserve his degrading sanity.\r\n\r\n[Written by MAL Rewrite]",
            "studios": [
                "White Fox"
            ],
            "genres": [
                "Drama",
                "Sci-Fi",
                "Suspense",
                "Psychological",
                "Time Travel"
            ],
            "popularity": 2600000,
            "score": 9.07,
            "img": "https://cdn.myanimelist.net/images/anime/1935/127974.jpg"
        },
        "rating": null,
        "date_liked": "2024-07-18"
    },
    {
        "id": 138,
        "user": 1,
        "anime": {
            "id": 39942,
            "name": "Sousou no Frieren",
            "desc": "During their decade-long quest to defeat the Demon King, the members of the hero's party—Himmel himself, the priest Heiter, the dwarf warrior Eisen, and the elven mage Frieren—forge bonds through adventures and battles, creating unforgettable precious memories for most of them.\r\n\r\nHowever, the time that Frieren spends with her comrades is equivalent to merely a fraction of her life, which has lasted over a thousand years. When the party disbands after their victory, Frieren casually returns to her \"usual\" routine of collecting spells across the continent. Due to her different sense of time, she seemingly holds no strong feelings toward the experiences she went through.\r\n\r\nAs the years pass, Frieren gradually realizes how her days in the hero's party truly impacted her. Witnessing the deaths of two of her former companions, Frieren begins to regret having taken their presence for granted; she vows to better understand humans and create real personal connections. Although the story of that once memorable journey has long ended, a new tale is about to begin.\r\n\r\n[Written by MAL Rewrite]",
            "studios": [
                "Madhouse"
            ],
            "genres": [
                "Adventure",
                "Drama",
                "Fantasy",
                "Shounen"
            ],
            "popularity": 812000,
            "score": 9.35,
            "img": "https://cdn.myanimelist.net/images/anime/1015/138006.jpg"
        },
        "rating": 10,
        "date_liked": "2024-07-19"
    },
    {
        "id": 139,
        "user": 1,
        "anime": {
            "id": 29241,
            "name": "Fullmetal Alchemist: Brotherhood",
            "desc": "After a horrific alchemy experiment goes wrong in the Elric household, brothers Edward and Alphonse are left in a catastrophic new reality. Ignoring the alchemical principle banning human transmutation, the boys attempted to bring their recently deceased mother back to life. Instead, they suffered brutal personal loss: Alphonse's body disintegrated while Edward lost a leg and then sacrificed an arm to keep Alphonse's soul in the physical realm by binding it to a hulking suit of armor.\r\n\r\nThe brothers are rescued by their neighbor Pinako Rockbell and her granddaughter Winry. Known as a bio-mechanical engineering prodigy, Winry creates prosthetic limbs for Edward by utilizing \"automail,\" a tough, versatile metal used in robots and combat armor. After years of training, the Elric brothers set off on a quest to restore their bodies by locating the Philosopher's Stone—a powerful gem that allows an alchemist to defy the traditional laws of Equivalent Exchange.\r\n\r\nAs Edward becomes an infamous alchemist and gains the nickname \"Fullmetal,\" the boys' journey embroils them in a growing conspiracy that threatens the fate of the world.\r\n\r\n[Written by MAL Rewrite]",
            "studios": [
                "Bones"
            ],
            "genres": [
                "Action",
                "Adventure",
                "Drama",
                "Fantasy",
                "Military",
                "Shounen"
            ],
            "popularity": 3400000,
            "score": 9.09,
            "img": "https://cdn.myanimelist.net/images/anime/1208/94745.jpg"
        },
        "rating": 9,
        "date_liked": "2024-07-19"
    },
    {
        "id": 126,
        "user": 1,
        "anime": {
            "id": 33038,
            "name": "Gintama°",
            "desc": "Gintoki, Shinpachi, and Kagura return as the fun-loving but broke members of the Yorozuya team! Living in an alternate-reality Edo, where swords are prohibited and alien overlords have conquered Japan, they try to thrive on doing whatever work they can get their hands on. However, Shinpachi and Kagura still haven't been paid... Does Gin-chan really spend all that cash playing pachinko?\r\n\r\nMeanwhile, when Gintoki drunkenly staggers home one night, an alien spaceship crashes nearby. A fatally injured crew member emerges from the ship and gives Gintoki a strange, clock-shaped device, warning him that it is incredibly powerful and must be safeguarded. Mistaking it for his alarm clock, Gintoki proceeds to smash the device the next morning and suddenly discovers that the world outside his apartment has come to a standstill. With Kagura and Shinpachi at his side, he sets off to get the device fixed; though, as usual, nothing is ever that simple for the Yorozuya team.\r\n\r\nFilled with tongue-in-cheek humor and moments of heartfelt emotion, Gintama's fourth season finds Gintoki and his friends facing both their most hilarious misadventures and most dangerous crises yet.\r\n\r\n[Written by MAL Rewrite]",
            "studios": [
                "Bandai Namco Pictures"
            ],
            "genres": [
                "Action",
                "Comedy",
                "Sci-Fi",
                "Gag Humor",
                "Historical",
                "Parody",
                "Samurai",
                "Shounen"
            ],
            "popularity": 638000,
            "score": 9.06,
            "img": "https://cdn.myanimelist.net/images/anime/3/72078.jpg"
        },
        "rating": null,
        "date_liked": "2024-07-18"
    }
]